UfkuAcik/FabGL-Studio-IDE/tests/esp32_runtime_tests.cpp
#include "test_harness.h"

#include <ProjectRuntime.h>
#include <ProjectSaveRuntime.h>
#include <ProjectScriptRuntime.h>
#include <esp32_export.h>
#include <fabgl/assets/asset_pack.h>
#include <fabgl/assets/image_pipeline.h>
#include <fabgl/reflection/reflection.h>
#include <fabgl/rendering/racer_track.h>
#include <fabgl/rendering/raycast_map_asset.h>
#include <fabgl/scene/builtin_components.h>
#include <fabgl/scene/entity.h>
#include <fabgl/scene/scene.h>
#include <fabgl/serialization/scene_serializer.h>
#include <project_format.h>

#include <cstdint>
#include <cstring>
#include <map>
#include <string>
#include <utility>
#include <vector>

namespace {

struct VectorReader final {
    const std::vector<std::uint8_t>* bytes = nullptr;

    [[nodiscard]] std::size_t size() const noexcept {
        return bytes->size();
    }
    [[nodiscard]] std::uint8_t byte(const std::size_t offset) const noexcept {
        return (*bytes)[offset];
    }
};

void appendU16(std::vector<std::uint8_t>& output, const std::uint16_t value) {
    output.push_back(static_cast<std::uint8_t>(value & 0xFFU));
    output.push_back(static_cast<std::uint8_t>((value >> 8U) & 0xFFU));
}

std::vector<std::uint8_t> wrapped(const std::string& path,
                                  const std::vector<std::uint8_t>& content) {
    FGL_CHECK(path.size() <= 65535U);
    std::vector<std::uint8_t> output{'F', 'G', 'L', 'A'};
    appendU16(output, 1U);
    appendU16(output, static_cast<std::uint16_t>(path.size()));
    output.insert(output.end(), path.begin(), path.end());
    output.insert(output.end(), content.begin(), content.end());
    return output;
}

fabgl::DataComponent* addBuiltin(fabgl::Entity& entity,
                                 const fabgl::ReflectionRegistry& registry,
                                 const char* name) {
    auto component = fabgl::createBuiltinDataComponent(registry, name);
    FGL_CHECK(component);
    auto* result = component.value().get();
    FGL_CHECK(entity.addComponent(std::move(component.value())));
    return result;
}

fabgl::rendering::RacerTrackAsset testTrack(const fabgl::AssetGuid guid) {
    fabgl::rendering::RacerTrackAsset track;
    track.guid = guid;
    track.name = "Embedded Track";
    track.segmentLength = 12.0F;
    track.startSegment = 0U;
    track.finishSegment = 3U;
    track.weather = {fabgl::rendering::RacerWeatherKind::Clear, 0.0F, 1.0F, 0.0F,
                     {255U, 255U, 255U, 255U}, 7U};
    track.segments.resize(4U);
    track.segments[0].curve = 0.1F;
    track.segments[1].curve = -0.2F;
    track.segments[2].hill = 0.15F;
    track.segments[3].width = 0.85F;
    track.checkpoints = {{0U, "Start"}};
    return track;
}

std::uint32_t scriptStarts = 0U;
std::uint32_t scriptUpdates = 0U;

void startPortableScript(fabgl_project_runtime::RuntimeProject& project) noexcept {
    ++scriptStarts;
    if (project.scene.entityCount != 0U)
        project.scene.entities[0].x = 10.0F;
}

void updatePortableScript(fabgl_project_runtime::RuntimeProject& project,
                          const float deltaSeconds) noexcept {
    ++scriptUpdates;
    if (project.scene.entityCount != 0U)
        project.scene.entities[0].x += deltaSeconds * 20.0F;
}

const fabgl_project_scripts::Descriptor PortableDescriptors[]{
    {sizeof(fabgl_project_scripts::Descriptor), "test.portable", &startPortableScript,
     &updatePortableScript}};

bool portableModule(fabgl_project_scripts::ModuleView* output) noexcept {
    if (output == nullptr)
        return false;
    output->structureSize = sizeof(*output);
    output->abiVersion = fabgl_project_scripts::kAbiVersion;
    output->descriptors = PortableDescriptors;
    output->descriptorCount = 1U;
    return true;
}

fabgl_project_runtime::Guid saveTestGuid(const std::uint8_t seed) {
    fabgl_project_runtime::Guid result;
    for (std::size_t index = 0U; index < sizeof(result.bytes); ++index)
        result.bytes[index] = static_cast<std::uint8_t>(seed + index);
    return result;
}

struct MemorySaveStorage final {
    std::map<std::string, std::vector<std::uint8_t>> files;
    bool failStage = false;
    bool failCommitAfterBackup = false;
    std::size_t discarded = 0U;

    fabgl_project_save::StorageCallbacks callbacks() {
        fabgl_project_save::StorageCallbacks result;
        result.context = this;
        result.read = &readThunk;
        result.stage = &stageThunk;
        result.commit = &commitThunk;
        result.discard = &discardThunk;
        result.remove = &removeThunk;
        return result;
    }

    static fabgl_project_save::StorageStatus
    readThunk(void* context, const char* path, std::uint8_t* output,
              const std::size_t capacity, std::size_t* size) noexcept {
        auto& self = *static_cast<MemorySaveStorage*>(context);
        const auto found = self.files.find(path);
        if (found == self.files.end())
            return fabgl_project_save::StorageStatus::NotFound;
        if (found->second.size() > capacity)
            return fabgl_project_save::StorageStatus::CapacityExceeded;
        std::memcpy(output, found->second.data(), found->second.size());
        *size = found->second.size();
        return fabgl_project_save::StorageStatus::Ok;
    }

    static fabgl_project_save::StorageStatus
    stageThunk(void* context, const char* path, const std::uint8_t* data,
               const std::size_t size) noexcept {
        auto& self = *static_cast<MemorySaveStorage*>(context);
        if (self.failStage)
            return fabgl_project_save::StorageStatus::IoFailure;
        self.files[path] = std::vector<std::uint8_t>(data, data + size);
        return fabgl_project_save::StorageStatus::Ok;
    }

    static fabgl_project_save::StorageStatus
    commitThunk(void* context, const char* live, const char* temporary,
                const char* backup) noexcept {
        auto& self = *static_cast<MemorySaveStorage*>(context);
        const auto staged = self.files.find(temporary);
        if (staged == self.files.end())
            return fabgl_project_save::StorageStatus::CommitFailed;
        const auto existing = self.files.find(live);
        if (existing != self.files.end()) {
            self.files[backup] = existing->second;
            self.files.erase(existing);
        } else {
            self.files.erase(backup);
        }
        if (self.failCommitAfterBackup) {
            const auto previous = self.files.find(backup);
            if (previous != self.files.end()) {
                self.files[live] = previous->second;
                self.files.erase(previous);
            }
            return fabgl_project_save::StorageStatus::CommitFailed;
        }
        self.files[live] = staged->second;
        self.files.erase(staged);
        return fabgl_project_save::StorageStatus::Ok;
    }

    static void discardThunk(void* context, const char* path) noexcept {
        auto& self = *static_cast<MemorySaveStorage*>(context);
        self.files.erase(path);
        ++self.discarded;
    }

    static fabgl_project_save::StorageStatus removeThunk(void* context,
                                                         const char* path) noexcept {
        auto& self = *static_cast<MemorySaveStorage*>(context);
        return self.files.erase(path) == 0U ? fabgl_project_save::StorageStatus::NotFound
                                           : fabgl_project_save::StorageStatus::Ok;
    }
};

fabgl_project_runtime::RuntimeProject saveRuntimeFixture() {
    fabgl_project_runtime::RuntimeProject project;
    project.loaded = true;
    project.scene.guid = saveTestGuid(1U);
    FGL_CHECK(fabgl_project_save::detail::assignText(project.scene.name, "Save Scene"));
    project.scene.entityCount = 2U;
    auto& player = project.scene.entities[0];
    player.guid = saveTestGuid(33U);
    FGL_CHECK(fabgl_project_save::detail::assignText(player.name, "Player One"));
    player.active = true;
    player.components = fabgl_project_runtime::Component::Character |
                        fabgl_project_runtime::Component::Sprite;
    player.movementMode = 1;
    player.x = 12.5F;
    player.y = -4.0F;
    player.z = 7.25F;
    player.rotationZ = 0.75F;
    player.scaleX = 1.5F;
    player.scaleY = 0.5F;
    player.velocityY = -9.0F;
    player.vehicleSpeed = 3.0F;
    auto& door = project.scene.entities[1];
    door.guid = saveTestGuid(65U);
    FGL_CHECK(fabgl_project_save::detail::assignText(door.name, "Exit Door"));
    door.active = false;
    door.x = 99.0F;
    door.y = 24.0F;
    return project;
}

