UfkuAcik/FabGL-Studio-IDE/tests/esp32_runtime_tests.cpp
bool migrateSaveV1ToV2(void* context, const std::uint32_t from,
                       fabgl_project_save::Document& document) noexcept {
    auto* count = static_cast<std::uint32_t*>(context);
    ++*count;
    return from == 1U &&
           document.putPrimitive("migration", fabgl_project_save::Value::unsigned32(2U));
}

struct PersistenceProbe final {
    std::size_t saves = 0U;
    std::size_t loads = 0U;
    fabgl_project_save::Document* document = nullptr;
    std::uint8_t error = 17U;
};

bool probeSave(void* context, fabgl_project_runtime::RuntimeProject&, const char* slot,
               const fabgl_project_runtime::Guid*,
               fabgl_project_save::Document* document) noexcept {
    auto& probe = *static_cast<PersistenceProbe*>(context);
    ++probe.saves;
    probe.document = document;
    return slot != nullptr && std::strcmp(slot, "probe") == 0;
}

bool probeLoad(void* context, fabgl_project_runtime::RuntimeProject&, const char* slot,
               const fabgl_project_runtime::Guid*,
               fabgl_project_save::Document* document) noexcept {
    auto& probe = *static_cast<PersistenceProbe*>(context);
    ++probe.loads;
    probe.document = document;
    return slot != nullptr && std::strcmp(slot, "probe") == 0;
}

std::uint8_t probeError(const void* context) noexcept {
    return static_cast<const PersistenceProbe*>(context)->error;
}

} // namespace

FGL_TEST(esp32_runtime_persistence_is_bound_and_invoked_only_by_explicit_gameplay_calls) {
    auto runtime = saveRuntimeFixture();
    fabgl_project_save::Document state;
    const auto player = runtime.scene.entities[0].guid;
    FGL_CHECK(!runtime.persistenceAvailable());
    FGL_CHECK(!runtime.saveSlot("probe", &player, &state));
    PersistenceProbe probe;
    runtime.bindPersistence(&probe, &probeSave, &probeLoad, &probeError);
    FGL_CHECK(runtime.persistenceAvailable());
    FGL_CHECK(probe.saves == 0U && probe.loads == 0U);
    FGL_CHECK(runtime.saveSlot("probe", &player, &state));
    FGL_CHECK(runtime.loadSlot("probe", &player, &state));
    FGL_CHECK(probe.saves == 1U && probe.loads == 1U && probe.document == &state);
    FGL_CHECK(runtime.lastPersistenceError() == 17U);
}

FGL_TEST(esp32_gameplay_save_round_trips_primitives_vectors_strings_scene_entities_and_player) {
    using namespace fabgl_project_save;
    auto runtime = saveRuntimeFixture();
    const auto playerGuid = runtime.scene.entities[0].guid;
    const auto doorGuid = runtime.scene.entities[1].guid;
    Document source;
    FGL_CHECK(captureRuntime(runtime, &playerGuid, source, 2U, 41U));
    FGL_CHECK(source.putPrimitive("alive", Value::boolean(true)));
    FGL_CHECK(source.putPrimitive("score", Value::signed32(-120)));
    FGL_CHECK(source.putPrimitive("coins", Value::unsigned32(9001U)));
    FGL_CHECK(source.putPrimitive("time", Value::real(12.25F)));
    FGL_CHECK(source.putPrimitive("cursor", Value::vector2(3.0F, -2.0F)));
    FGL_CHECK(source.putPrimitive("spawn", Value::vector3(4.0F, 5.0F, 6.0F)));
    FGL_CHECK(source.putPrimitive("chapter", Value::string("Citadel")));
    FGL_CHECK(source.putPrimitive("door", Value::entity(doorGuid)));
    FGL_CHECK(!source.putPrimitive("overflow", Value::unsigned32(1U)));
    FGL_CHECK(source.putScene("weather", Value::string("rain")));
    FGL_CHECK(source.putPlayer("health", Value::unsigned32(73U)));

    MemorySaveStorage memory;
    SaveService saves(memory.callbacks(), "/fabglstudio/saves", 2U);
    FGL_CHECK(saves.configured());
    std::vector<std::uint8_t> working(kMaximumFileBytes);
    FGL_CHECK(saves.save("campaign-1", source, working.data(), working.size()));
    FGL_CHECK(saves.save("checkpoint_2", source, working.data(), working.size()));

    Document loaded;
    LoadInfo info;
    FGL_CHECK(saves.load("campaign-1", loaded, working.data(), working.size(), &info));
    FGL_CHECK(info.storedSchemaVersion == 2U && !info.migrated &&
              !info.recoveredFromBackup);
    FGL_CHECK(loaded.sequence == 41U && loaded.entityCount == 2U);
    FGL_CHECK(loaded.primitive("alive")->payload.booleanValue);
    FGL_CHECK(loaded.primitive("score")->payload.signedValue == -120);
    FGL_CHECK(loaded.primitive("coins")->payload.unsignedValue == 9001U);
    FGL_CHECK(loaded.primitive("time")->payload.floatValue == 12.25F);
    FGL_CHECK(loaded.primitive("cursor")->payload.vector2Value.x == 3.0F);
    FGL_CHECK(loaded.primitive("spawn")->payload.vector3Value.z == 6.0F);
    FGL_CHECK(std::strcmp(loaded.primitive("chapter")->payload.stringValue, "Citadel") == 0);
    FGL_CHECK(std::memcmp(loaded.primitive("door")->payload.guidValue, doorGuid.bytes,
                          sizeof(doorGuid.bytes)) == 0);
    FGL_CHECK(std::strcmp(loaded.scene("weather")->payload.stringValue, "rain") == 0);
    FGL_CHECK(loaded.player("health")->payload.unsignedValue == 73U);

    runtime.scene.entities[0].x = -500.0F;
    runtime.scene.entities[0].active = false;
    runtime.scene.entities[1].x = -800.0F;
    FGL_CHECK(restoreRuntime(loaded, runtime, &playerGuid));
    FGL_CHECK(runtime.scene.entities[0].x == 12.5F);
    FGL_CHECK(runtime.scene.entities[0].active);
    FGL_CHECK(runtime.scene.entities[0].velocityY == -9.0F);
    FGL_CHECK(runtime.scene.entities[1].x == 99.0F);
    FGL_CHECK(!runtime.scene.entities[1].active);
    const auto wrongPlayer = saveTestGuid(111U);
    FGL_CHECK(restoreRuntime(loaded, runtime, &wrongPlayer).error == Error::PlayerMismatch);

    FGL_CHECK(saves.removeSlot("checkpoint_2"));
    FGL_CHECK(saves.load("checkpoint_2", loaded, working.data(), working.size()).error ==
              Error::NotFound);
}

FGL_TEST(esp32_gameplay_save_checks_versions_checksums_paths_capacity_and_migration) {
    using namespace fabgl_project_save;
    auto runtime = saveRuntimeFixture();
    const auto playerGuid = runtime.scene.entities[0].guid;
    Document versionOne;
    FGL_CHECK(captureRuntime(runtime, &playerGuid, versionOne, 1U, 9U));
    FGL_CHECK(versionOne.putPrimitive("chapter", Value::string("one")));
    MemorySaveStorage memory;
    std::vector<std::uint8_t> working(kMaximumFileBytes);
    SaveService oldSaves(memory.callbacks(), "/saves", 1U);
    FGL_CHECK(oldSaves.save("migration", versionOne, working.data(), working.size()));

    SaveService current(memory.callbacks(), "/saves", 2U);
    Document migrated;
    FGL_CHECK(current.load("migration", migrated, working.data(), working.size()).error ==
              Error::MigrationMissing);
    std::uint32_t migrationCount = 0U;
    MigrationCallbacks migrations;
    migrations.context = &migrationCount;
    migrations.step = &migrateSaveV1ToV2;
    LoadInfo info;
    FGL_CHECK(current.load("migration", migrated, working.data(), working.size(), &info,
                           migrations));
    FGL_CHECK(migrationCount == 1U && info.migrated && info.storedSchemaVersion == 1U);
    FGL_CHECK(migrated.schemaVersion == 2U);
    FGL_CHECK(migrated.primitive("migration")->payload.unsignedValue == 2U);

    FGL_CHECK(!oldSaves.save("../escape", versionOne, working.data(), working.size()));
    FGL_CHECK(oldSaves.lastError() == Error::InvalidArgument);
    SaveService relativeRoot(memory.callbacks(), "relative/saves", 1U);
    FGL_CHECK(!relativeRoot.configured());
    FGL_CHECK(relativeRoot.save("slot", versionOne, working.data(), working.size()).error ==
              Error::StorageUnavailable);
    std::uint8_t tiny[64]{};
    FGL_CHECK(encode(versionOne, tiny, sizeof(tiny)).error == Error::CapacityExceeded);
    auto excessiveRuntime = saveRuntimeFixture();
    excessiveRuntime.scene.entityCount = kMaximumSaveEntities + 1U;
    Document excessive;
    FGL_CHECK(captureRuntime(excessiveRuntime, nullptr, excessive, 1U).error ==
              Error::CapacityExceeded);
    memory.files["/saves/oversized.fglsave"] =
        std::vector<std::uint8_t>(kMaximumFileBytes + 1U, 0U);
    FGL_CHECK(oldSaves.load("oversized", excessive, working.data(), working.size()).error ==
              Error::CapacityExceeded);

    FGL_CHECK(oldSaves.save("corrupt", versionOne, working.data(), working.size()));
    auto& corrupt = memory.files["/saves/corrupt.fglsave"];
    corrupt.back() ^= 0x55U;
    Document rejected;
    FGL_CHECK(oldSaves.load("corrupt", rejected, working.data(), working.size()).error ==
              Error::ChecksumMismatch);

    FGL_CHECK(oldSaves.save("format", versionOne, working.data(), working.size()));
    auto& unsupported = memory.files["/saves/format.fglsave"];
    unsupported[4] = 2U;
    FGL_CHECK(oldSaves.load("format", rejected, working.data(), working.size()).error ==
              Error::UnsupportedVersion);

    SaveService olderRuntime(memory.callbacks(), "/saves", 1U);
    Document schemaTwo = versionOne;
    schemaTwo.schemaVersion = 2U;
    SaveService schemaTwoWriter(memory.callbacks(), "/saves", 2U);
    FGL_CHECK(schemaTwoWriter.save("future", schemaTwo, working.data(), working.size()));
    FGL_CHECK(olderRuntime.load("future", rejected, working.data(), working.size()).error ==
              Error::SchemaTooNew);

