UfkuAcik/FabGL-Studio-IDE/tests/esp32_runtime_tests.cpp
    auto missingEntityRuntime = saveRuntimeFixture();
    missingEntityRuntime.scene.entityCount = 1U;
    FGL_CHECK(restoreRuntime(versionOne, missingEntityRuntime, &playerGuid).error ==
              Error::EntityMissing);
    auto wrongSceneRuntime = saveRuntimeFixture();
    wrongSceneRuntime.scene.guid = saveTestGuid(220U);
    FGL_CHECK(restoreRuntime(versionOne, wrongSceneRuntime, &playerGuid).error ==
              Error::SceneMismatch);
}

FGL_TEST(esp32_gameplay_save_write_failures_preserve_the_previous_live_slot) {
    using namespace fabgl_project_save;
    auto runtime = saveRuntimeFixture();
    const auto playerGuid = runtime.scene.entities[0].guid;
    Document state;
    FGL_CHECK(captureRuntime(runtime, &playerGuid, state, 1U, 1U));
    FGL_CHECK(state.putPrimitive("revision", Value::unsigned32(1U)));
    MemorySaveStorage memory;
    SaveService saves(memory.callbacks(), "/saves", 1U);
    std::vector<std::uint8_t> working(kMaximumFileBytes);
    FGL_CHECK(saves.save("atomic", state, working.data(), working.size()));

    FGL_CHECK(state.putPrimitive("revision", Value::unsigned32(2U)));
    state.sequence = 2U;
    memory.failStage = true;
    FGL_CHECK(saves.save("atomic", state, working.data(), working.size()).error ==
              Error::IoFailure);
    memory.failStage = false;
    Document loaded;
    FGL_CHECK(saves.load("atomic", loaded, working.data(), working.size()));
    FGL_CHECK(loaded.sequence == 1U);
    FGL_CHECK(loaded.primitive("revision")->payload.unsignedValue == 1U);

    memory.failCommitAfterBackup = true;
    FGL_CHECK(saves.save("atomic", state, working.data(), working.size()).error ==
              Error::CommitFailed);
    memory.failCommitAfterBackup = false;
    FGL_CHECK(saves.load("atomic", loaded, working.data(), working.size()));
    FGL_CHECK(loaded.sequence == 1U);
    FGL_CHECK(loaded.primitive("revision")->payload.unsignedValue == 1U);
    FGL_CHECK(memory.discarded >= 2U);

    // A later successful generation retains revision 1 as .bak. If the new live bytes are
    // corrupted, load validates and returns the complete previous generation explicitly.
    FGL_CHECK(saves.save("atomic", state, working.data(), working.size()));
    memory.files["/saves/atomic.fglsave"].back() ^= 0x80U;
    LoadInfo recovered;
    FGL_CHECK(saves.load("atomic", loaded, working.data(), working.size(), &recovered));
    FGL_CHECK(recovered.recoveredFromBackup);
    FGL_CHECK(loaded.sequence == 1U);
    FGL_CHECK(loaded.primitive("revision")->payload.unsignedValue == 1U);
}

FGL_TEST(esp32_portable_script_runtime_validates_abi_and_runs_bounded_callbacks) {
    fabgl_project_runtime::RuntimeProject project;
    project.scene.entityCount = 1U;
    scriptStarts = 0U;
    scriptUpdates = 0U;
    fabgl_project_scripts::Runtime scripts;
    FGL_CHECK(scripts.initialize(&portableModule, project, true));
    FGL_CHECK(scripts.initialized() && scripts.count() == 1U);
    FGL_CHECK(scriptStarts == 1U && project.scene.entities[0].x == 10.0F);
    scripts.update(project, 0.25F);
    FGL_CHECK(scriptUpdates == 1U);
    FGL_CHECK(project.scene.entities[0].x == 12.0F);
    FGL_CHECK(scripts.updateCount() == 1U);

    fabgl_project_scripts::Runtime optional;
    FGL_CHECK(optional.initialize(nullptr, project, false));
    FGL_CHECK(optional.count() == 0U);
    fabgl_project_scripts::Runtime required;
    FGL_CHECK(!required.initialize(nullptr, project, true));
    FGL_CHECK(required.error() == fabgl_project_scripts::Error::MissingEntryPoint);
}

FGL_TEST(esp32_soak_workload_is_fixed_capacity_and_exercises_every_required_churn_path) {
    fabgl_project_runtime::SoakWorkload soak;
    FGL_CHECK(soak.invariantHolds());

    for (std::size_t iteration = 0U;
         iteration < fabgl_project_runtime::kSoakEntityCapacity * 4U; ++iteration) {
        const auto step = soak.advance(true);
        FGL_CHECK(step.projectSceneActive == soak.projectSceneActive);
        FGL_CHECK(step.assetResident == soak.assetResident);
        FGL_CHECK(step.entityCreated != step.entityDestroyed);
        FGL_CHECK(step.entitySlot < fabgl_project_runtime::kSoakEntityCapacity);
        FGL_CHECK(soak.invariantHolds());
    }

    FGL_CHECK(soak.iterations == fabgl_project_runtime::kSoakEntityCapacity * 4U);
    FGL_CHECK(soak.sceneTransitions == soak.iterations);
    FGL_CHECK(soak.assetLoads == soak.iterations / 2U);
    FGL_CHECK(soak.assetUnloads == soak.iterations / 2U);
    FGL_CHECK(soak.audioPlays == soak.iterations);
    FGL_CHECK(soak.entityCreates == fabgl_project_runtime::kSoakEntityCapacity * 2U);
    FGL_CHECK(soak.entityDestroys == fabgl_project_runtime::kSoakEntityCapacity * 2U);
    FGL_CHECK(soak.liveEntities == 0U);

    fabgl_project_runtime::SoakWorkload noAsset;
    for (std::size_t iteration = 0U; iteration < 8U; ++iteration)
        static_cast<void>(noAsset.advance(false));
    FGL_CHECK(noAsset.assetLoads == 0U && noAsset.assetUnloads == 0U);
    FGL_CHECK(noAsset.invariantHolds());
}

FGL_TEST(esp32_runtime_streams_desktop_serializers_and_updates_script_free_components) {
    const auto spriteGuid = fabgl::AssetGuid::fromStableName("tests.esp32-runtime.sprite");
    const auto raycastGuid = fabgl::AssetGuid::fromStableName("tests.esp32-runtime.raycast");
    const auto trackGuid = fabgl::AssetGuid::fromStableName("tests.esp32-runtime.track");

    fabgl::assets::IndexedImage image;
    image.width = 2;
    image.height = 2;
    image.palette = {{0U, 0U, 0U, 0U}, {255U, 190U, 40U, 255U}};
    image.indices = {1U, 1U, 0U, 1U};
    image.transparentIndex = 0U;
    const auto imageBytes = fabgl::assets::encodeIndexedImage(image);
    FGL_CHECK(!imageBytes.empty());

    fabgl::rendering::RaycastMapAsset raycast;
    raycast.guid = raycastGuid;
    raycast.map = fabgl::rendering::makeDemoRaycastMap();
    auto raycastText = fabgl::rendering::serializeRaycastMapAsset(raycast);
    FGL_CHECK(raycastText);
    auto trackText = fabgl::rendering::serializeRacerTrack(testTrack(trackGuid));
    FGL_CHECK(trackText);

