UfkuAcik/FabGL-Studio-IDE/tests/esp32_runtime_tests.cpp
    fabgl::ReflectionRegistry registry;
    FGL_CHECK(fabgl::registerBuiltinComponentTypes(registry));
    fabgl::Scene scene("Embedded Runtime",
                       fabgl::SceneGuid::fromStableName("tests.esp32-runtime.scene"));
    auto character = scene.createEntity(
        "Character", fabgl::EntityGuid::fromStableName("tests.esp32-runtime.character"));
    auto vehicle = scene.createEntity(
        "Vehicle", fabgl::EntityGuid::fromStableName("tests.esp32-runtime.vehicle"));
    auto map = scene.createEntity(
        "Map", fabgl::EntityGuid::fromStableName("tests.esp32-runtime.map"));
    auto camera = scene.createEntity(
        "Camera", fabgl::EntityGuid::fromStableName("tests.esp32-runtime.camera"));
    FGL_CHECK(character && vehicle && map && camera);
    character.value()->transform().setLocalPosition({32.0F, 188.0F, 0.0F});
    auto* sprite = addBuiltin(*character.value(), registry, "SpriteRenderer");
    auto* body = addBuiltin(*character.value(), registry, "CharacterBody2D");
    FGL_CHECK(sprite->set("sprite", spriteGuid));
    FGL_CHECK(body->set("moveSpeed", 20.0));
    auto* vehicleComponent = addBuiltin(*vehicle.value(), registry, "VehicleController");
    FGL_CHECK(vehicleComponent->set("track", trackGuid));
    FGL_CHECK(vehicleComponent->set("acceleration", 12.0));
    auto* mapComponent = addBuiltin(*map.value(), registry, "RaycastMap");
    FGL_CHECK(mapComponent->set("map", raycastGuid));
    auto* firstPerson = addBuiltin(*camera.value(), registry, "FirstPersonController");
    FGL_CHECK(firstPerson->set("moveSpeed", 5.0));
    camera.value()->transform().setLocalPosition({2.5F, 2.5F, 0.0F});
    auto sceneText = fabgl::SceneSerializer::serialize(scene);
    FGL_CHECK(sceneText);

    fabgl::project::Manifest manifest;
    manifest.projectGuid =
        fabgl::AssetGuid::fromStableName("tests.esp32-runtime.project").toString();
    manifest.name = "ESP32 Script-Free Runtime";
    manifest.assets = {{spriteGuid, "Images/Hero.fgli", "image", {}},
                       {raycastGuid, "Maps/Main.fglray", "raycast.map", {}},
                       {trackGuid, "Tracks/Main.fgltrack", "racer.track", {}}};
    fabgl::project::InputContextDefinition context;
    context.name = "gameplay";
    context.priority = 4;
    context.actions = {{"Jump", {{"Key.Space", 1.0F, 0.5F}}},
                       {"Brake", {{"Key.Space", 1.0F, 0.5F}}}};
    context.axes = {{"MoveX", {{"Key.A", -1.0F, 0.5F}, {"Key.D", 1.0F, 0.5F}}},
                    {"MoveY", {{"Key.S", -1.0F, 0.5F}, {"Key.W", 1.0F, 0.5F}}},
                    {"Steer", {{"Key.A", -1.0F, 0.5F}, {"Key.D", 1.0F, 0.5F}}},
                    {"Throttle", {{"Key.W", 1.0F, 0.5F}}},
                    {"LookX", {{"Mouse.X", 0.75F, 0.0F}}}};
    manifest.inputContexts.push_back(std::move(context));
    auto manifestText = fabgl::project::serializeManifest(manifest);
    FGL_CHECK(manifestText);

    std::vector<fabgl::assets::PackInput> inputs;
    inputs.push_back({fabgl::AssetGuid::fromStableName("tests.esp32-runtime.manifest"),
                      fabgl::project::Esp32ManifestPayloadType,
                      fabgl::assets::StorageClass::Flash,
                      {manifestText.value().begin(), manifestText.value().end()}});
    inputs.push_back({fabgl::AssetGuid::fromStableName("tests.esp32-runtime.scene-payload"),
                      fabgl::project::Esp32ScenePayloadType,
                      fabgl::assets::StorageClass::Flash,
                      {sceneText.value().begin(), sceneText.value().end()}});
    inputs.push_back({spriteGuid, fabgl::project::Esp32AssetPayloadType,
                      fabgl::assets::StorageClass::Flash,
                      wrapped("Images/Hero.fgli", imageBytes)});
    inputs.push_back({raycastGuid, fabgl::project::Esp32AssetPayloadType,
                      fabgl::assets::StorageClass::Flash,
                      wrapped("Maps/Main.fglray",
                              {raycastText.value().begin(), raycastText.value().end()})});
    inputs.push_back({trackGuid, fabgl::project::Esp32AssetPayloadType,
                      fabgl::assets::StorageClass::Flash,
                      wrapped("Tracks/Main.fgltrack",
                              {trackText.value().begin(), trackText.value().end()})});
    auto pack = fabgl::assets::buildPack(std::move(inputs));
    FGL_CHECK(pack);
    VectorReader reader{&pack.value().bytes};
    fabgl_project_runtime::RuntimeProject runtime;
    fabgl_project_runtime::Failure failure;
    const auto payloadChecksum = fabgl::assets::checksum64(pack.value().bytes.data(),
                                                           pack.value().bytes.size());
    if (!fabgl_project_runtime::loadProject(
            reader, 3U, payloadChecksum, pack.value().buildChecksum,
            "olimex-esp32-sbc-fabgl-revb", runtime, failure)) {
        throw fabgl::tests::AssertionFailure(
            "ESP32 runtime load failed: code=" +
            std::to_string(static_cast<unsigned int>(failure.code)) +
            " offset=" + std::to_string(failure.offset) + " detail=" + failure.detail);
    }
    FGL_CHECK(runtime.loaded);
    FGL_CHECK(runtime.scene.entityCount == 4U);
    FGL_CHECK(runtime.manifest.assetCount == 3U);
    FGL_CHECK(runtime.manifest.inputBindingCount == 10U);
    fabgl_project_runtime::Guid runtimeRaycast;
    fabgl_project_runtime::Guid runtimeTrack;
    FGL_CHECK(fabgl_project_runtime::detail::parseGuidText(raycastGuid.toString().c_str(),
                                                           runtimeRaycast));
    FGL_CHECK(fabgl_project_runtime::detail::parseGuidText(trackGuid.toString().c_str(),
                                                           runtimeTrack));
    FGL_CHECK(runtime.raycastMap.valid && runtime.raycastMap.guid == runtimeRaycast);
    FGL_CHECK(runtime.racerTrack.valid && runtime.racerTrack.guid == runtimeTrack);
    FGL_CHECK(runtime.racerTrack.segmentCount == 4U);

    fabgl_project_runtime::IndexedImageView imageView;
    fabgl_project_runtime::Failure imageFailure;
    fabgl_project_runtime::Guid runtimeSprite;
    FGL_CHECK(fabgl_project_runtime::detail::parseGuidText(spriteGuid.toString().c_str(),
                                                           runtimeSprite));
    FGL_CHECK(fabgl_project_runtime::inspectIndexedImage(reader, runtime, runtimeSprite, imageView,
                                                         imageFailure));
    FGL_CHECK(imageView.width == 2U && imageView.height == 2U && imageView.pixelCount == 4U);

    const auto characterX = runtime.scene.entities[0].x;
    FGL_CHECK(runtime.setControl("Key.D", 1.0F));
    FGL_CHECK(runtime.setControl("Key.W", 1.0F));
    FGL_CHECK(runtime.setControl("Mouse.X", 0.5F, true));
    runtime.update(0.1F);
    FGL_CHECK(runtime.scene.entities[0].x > characterX);
    FGL_CHECK(runtime.scene.entities[1].vehicleSpeed > 0.0F);
    FGL_CHECK(runtime.scene.entities[3].rotationZ > 0.0F);
    runtime.update(0.1F);
    const auto secondRotation = runtime.scene.entities[3].rotationZ;
    runtime.update(0.1F);
    FGL_CHECK(runtime.scene.entities[3].rotationZ == secondRotation);
}

FGL_TEST(esp32_runtime_rejects_corrupt_pack_before_reading_scene) {
    std::vector<std::uint8_t> bytes(32U, 0U);
    bytes[0] = 'F';
    bytes[1] = 'G';
    bytes[2] = 'L';
    bytes[3] = 'P';
    VectorReader reader{&bytes};
    fabgl_project_runtime::RuntimeProject runtime;
    fabgl_project_runtime::Failure failure;
    FGL_CHECK(!fabgl_project_runtime::loadProject(reader, 0U, 0U, 0U,
                                                  "olimex-esp32-sbc-fabgl-revb", runtime,
                                                  failure));
    FGL_CHECK(failure.code == fabgl_project_runtime::ErrorCode::InvalidPack);
    FGL_CHECK(!runtime.loaded);
}
